#Пицца
pizza = ['Маргарита',
		 'Маринара',
		 'Наполетана',
		 'Каприциоза',
		 'Сицилия',
		 '4 Сыра',
		 'Классическая',
		 'Охотничья',
		 'Пепперони',
		 'Филадельфия']


#Прентенденты
applicant = ['Шаров',
			 'Рыбников',
			 'Селюнин',
			 'Буторов',
			 'Соколов',
			 'Кораблев',
			 'Четвериков',
			 'Анфимов',
			 'Кузнецова',
			 'Лавров',
			 'Леденев',
			 'Чашечкин',
			 'Сайфулин',
			 'Попов',
			 'Иванова',
			 'Самойлов',
			 'Морозова',
			 'Соколов',
			 'Чудакова',
			 'Рыбовалова']

#Оценки
mark = [[0, 0, 0, 0, 10, 0, 0, 0, 0, 0], 
		[10,2, 1,  2, 1,  1,  7, 10,9, 3], 
		[2, 8, 2,  4, 9,  0,  4, 6, 5, 1],
		[7, 7, 10, 9, 1,  2,  1, 6, 5, 10],
		[1, 7, 2,  8, 0,  10, 3, 0, 9, 10],
		[3, 6, 2,  9, 2,  3,  5, 8, 1, 9],
		[3, 5, 10, 4, 10, 10, 1, 6, 3, 0], 
		[3, 6, 2,  9, 2,  3,  5, 8, 1, 9], 
		[3, 5, 10, 4, 10, 10, 1, 0, 3, 10],
		[1, 0, 9,  8, 4,  9,  5, 9, 2, 4],
		[7, 4, 6,  2, 8,  9,  3, 7, 2, 9],
		[10,1, 2,  7, 6,  5,  2, 9, 3, 1],
		[3, 6, 2,  9, 2,  3,  5, 8, 1, 9], 
		[0, 5, 10, 4, 10, 10, 0, 6, 3, 3], 
		[10,2, 6,  2, 1,  1,  7, 10,9, 3], 
		[2, 8, 2,  4, 9,  10, 4, 6, 5, 1],
		[3, 5, 10, 4, 0,  10, 1, 6, 3, 5],
		[1, 1, 9,  8, 4,  9,  5, 9, 2, 4],
		[7, 4, 0,  0, 8,  9,  3, 7, 2, 9],
		[10,1, 2,  7, 6,  5,  2, 9, 0, 1]]




main_vector = [0,0,0,1,2,2,0,4,0,1]
step = 0.05
p = 9
max_L = 0.0
d = int(10/step)
vector_result = list()
for i in range(0,d):
		
	dis = (10 - main_vector[p])/9
	for z in range(0,10):
		if (z!= p):
			main_vector[z] = dis
	

	L = 1

	for j in range(0,len(mark)):	 
		Pk = 0
		Wk = 0
		
		for m in range(0,len(mark[j])):
			Wk = Wk + mark[j][m]
		
		for k in range(0,len(mark[j])):				
			Pk = Pk + (mark[j][k] * main_vector[k])/Wk		

		L = L * Pk
	print(str(i))
	print("L on step: " + str(L) + "  Max L: " + str(max_L) + "  " + str(vector_result) + "\n")
	
	if (L > max_L):
		max_L = L
		vector_result = list()
		for k in range(0,len(main_vector)):
			vector_result.append(main_vector[k])

		

	main_vector[p] = main_vector[p] + step 

	

print("*******************************************************************************")	
print("Лучший вариан: " + str(vector_result))

#for i in range (0,len(pizza)):
#	sum = 0
#	for j in range (0, len(mark)):
#		sum = sum + mark[j][i]
	#sum = sum/100
#	main_vector_2.append(sum)

#print("Средние значения: " + str(main_vector_2))