#Пицца
pizza = ['Маргарита',
		 'Маринара',
		 'Наполетана',
		 'Каприциоза',
		 'Сицилия',
		 '4 Сыра',
		 'Классическая',
		 'Охотничья',
		 'Пепперони',
		 'Филадельфия']


#Прентенденты
applicant = ['Шаров',
			 'Рыбников',
			 'Селюнин',
			 'Буторов',
			 'Соколов',
			 'Кораблев',
			 'Четвериков',
			 'Анфимов',
			 'Кузнецова',
			 'Лавров',
			 'Леденев',
			 'Чашечкин',
			 'Сайфулин',
			 'Попов',
			 'Иванова',
			 'Самойлов',
			 'Морозова',
			 'Соколов',
			 'Чудакова',
			 'Рыбовалова']

#Оценки
mark = [[0, 0, 0, 0, 10, 0, 0, 0, 0, 0], 
		[10,2, 1,  2, 1,  1,  7, 10,9, 3], 
		[2, 8, 2,  4, 9,  0,  4, 6, 5, 1],
		[7, 7, 10, 9, 1,  2,  1, 6, 5, 10],
		[1, 7, 2,  8, 0,  10, 3, 0, 9, 10],
		[3, 6, 2,  9, 2,  3,  5, 8, 1, 9],
		[3, 5, 10, 4, 10, 10, 1, 6, 3, 0], 
		[3, 6, 2,  9, 2,  3,  5, 8, 1, 9], 
		[3, 5, 10, 4, 10, 10, 1, 0, 3, 10],
		[1, 0, 9,  8, 4,  9,  5, 9, 2, 4],
		[7, 4, 6,  2, 8,  9,  3, 7, 2, 9],
		[10,1, 2,  7, 6,  5,  2, 9, 3, 1],
		[3, 6, 2,  9, 2,  3,  5, 8, 1, 9], 
		[0, 5, 10, 4, 10, 10, 0, 6, 3, 3], 
		[10,2, 6,  2, 1,  1,  7, 10,9, 3], 
		[2, 8, 2,  4, 9,  10, 4, 6, 5, 1],
		[3, 5, 10, 4, 0,  10, 1, 6, 3, 5],
		[1, 1, 9,  8, 4,  9,  5, 9, 2, 4],
		[7, 4, 0,  0, 8,  9,  3, 7, 2, 9],
		[10,1, 2,  7, 6,  5,  2, 9, 0, 1]]



with open('variation.txt') as my_file:
	data = list()
	for line in my_file:
		line = line.split() 
		if line:            
			line = [int(i) for i in line]
			data.append(line)

max_L= 0
main_vector = list()
for i in range(0,len(data)):
	L = 1

	for j in range(0,len(mark)):	 
		Pk = 0
		Wk = 0
		
		for m in range(0,len(mark[j])): #Находим сумму элементов в строке 
			Wk = Wk + mark[j][m]
		
		for k in range(0,len(mark[j])):	
			
			Pk = Pk + (mark[j][k] * data[i][k])/Wk		
	
		L = L * Pk

	if L>=max_L:
		max_L = L
		main_vector = list.copy(data[i])
	print(str(data[i]) + "     " + str(L))
	#print("\n" + str(i))
print("*******************************************************************************")	
print("Лучший вариан: " + str(main_vector) + "    L = " + str(max_L))
main_vector_2 = list()
for i in range (0,len(pizza)):
	sum = 0
	for j in range (0, len(mark)):
		sum = sum + mark[j][i]
	#sum = sum/100
	main_vector_2.append(sum)

#print("Средние значения: " + str(main_vector_2))